#+STARTUP: overview
** mode-line
#+begin_src emacs-lisp
  (use-package doom-modeline
    :ensure t
    :hook (after-init . doom-modeline-mode)
    :config
    (custom-set-faces
    '(mode-line ((t (:family "Noto Sans" :height 0.9))))
    '(mode-line-inactive ((t (:family "Noto Sans" :height 0.9))))))
#+end_src

#+RESULTS:
| doom-modeline-mode | magit-auto-revert-mode--init-kludge | magit-startup-asserts | magit-version |

